In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

In [3]:
df = pd.read_csv("/kaggle/input/employees/Employee Education.csv")

In [4]:
df.head()

,Employee ID,Course Name,Course Code,Supplier,Cost,Start Date,Year,Month
0,1,Python Course,1,IO Education,1450,25-06-17,2017,6
1,2,Python Course,1,IO Education,1450,25-06-17,2017,6
2,3,Python Course,1,IO Education,1450,25-06-17,2017,6
3,4,Python Course,1,IO Education,1450,25-06-17,2017,6
4,5,Python Course,1,IO Education,1450,25-06-17,2017,6

In [5]:
df.describe()

       Employee ID  Course Code        Cost         Year       Month
count   200.000000   200.000000   200.00000   200.000000  200.000000
mean     25.500000     9.890000  2119.50000  2018.410000    7.320000
std      14.467083     4.621112   592.64313     0.777769    2.571119
min       1.000000     1.000000  1450.00000  2017.000000    1.000000
25%      13.000000     6.000000  1500.00000  2018.000000    5.000000
50%      25.500000    11.000000  1950.00000  2018.000000    8.000000
75%      38.000000    14.000000  2550.00000  2019.000000   10.000000
max      50.000000    16.000000  3450.00000  2020.000000   11.000000

In [6]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 200 entries, 0 to 199
Data columns (total 8 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   Employee ID  200 non-null    int64
 1   Course Name  200 non-null    object
 2   Course Code  200 non-null    int64
 3   Supplier     200 non-null    object
 4   Cost         200 non-null    int64
 5   Start Date   200 non-null    object
 6   Year         200 non-null    int64
 7   Month        200 non-null    int64
dtypes: int64(5), object(3)
memory usage: 12.6+ KB

In [7]:
df.sample()

,Employee ID,Course Name,Course Code,Supplier,Cost,Start Date,Year,Month
11,12,Python Course,2,IO Education,1450,30-10-18,2018,10

In [8]:
df.tail()

,Employee ID,Course Name,Course Code,Supplier,Cost,Start Date,Year,Month
195,46,Conflict Management,15,Computer School,2550,05-08-19,2019,8
196,47,Conflict Management,15,Computer School,2550,05-08-19,2019,8
197,48,Conflict Management,15,Computer School,2550,22-09-18,2018,9
198,49,Conflict Management,15,Computer School,2550,22-09-18,2018,9
199,50,Computer Literacy,16,Computer School,1950,22-09-18,2018,9

In [9]:
df.rename(columns = {"Course Code" : "Course ID"} , inplace = True)

In [10]:
df.sample()

,Employee ID,Course Name,Course ID,Supplier,Cost,Start Date,Year,Month
95,46,Business Data Analysis,11,Excel Experts,3450,25-11-18,2018,11

In [11]:
df["Course Name"].unique()

array(['Python Course', 'Advanced Excel', 'Data Engineering Course',
       'Introduction To Excel', 'Business Data Analysis',
       'Conflict Management', 'Computer Literacy'], dtype=object)

In [12]:
df["Course Name"].nunique()

7

In [13]:
df["Course Name"].value_counts()

Course Name
Advanced Excel             46
Python Course              41
Computer Literacy          33
Data Engineering Course    28
Introduction To Excel      23
Business Data Analysis     16
Conflict Management        13
Name: count, dtype: int64